Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: You can specify NULL for either sizep or alignp to ignore the corresponding information.
ja: あなたは、NULLをsizepまたはalignpのどちらかに指定することで、対応する情報を無視できます。

source: You can specify different styles for the date and time information in each date value.
ja: あなたは、各日付値において日付と時刻情報に対して異なるスタイルを指定できます。

source: You can think of this method as transforming a vector whose origin is (0, 0) and whose end point is specified by the value in a Size.
ja: あなたは、このメソッドを、それの原点が(0, 0)でそれの終端点がa Sizeの値で指定されるベクター変換として思い浮かべることができます。

source: You can use pop Last() to remove the last element of a collection that might be empty.
ja: あなたはpop Last()を使って、空であるかもしれないコレクションの最後の要素を除去できます。

source: You can use get Object Value: for String: range: error: to get the old behavior—it returns the range of the substring that was successfully parsed.
ja: あなたは、get Object Value: for String: range: error:を使って古い挙動を得ることができます — それは、うまく構文解析された下位文字列の範囲を返します。

source: You can use an array literal anywhere a set is expected by the type context.
ja: あなたは、型コンテキストによって集合が予期される何処ででも配列リテラルを使うことができます。

source: You can use arrays when you need an ordered collection of objects.
ja: あなたは、オブジェクトの順番付けられたコレクションが必要な時に配列を使うことができます。

source: You can use null-device file handles as “placeholders” for standard-device file handles or in collection objects to avoid exceptions and other errors resulting from messages being sent to invalid file handles.
ja: あなたは、nullデバイスファイルハンドルを標準デバイスファイルハンドルに対してまたはコレクションオブジェクトにおいて「プレースホルダ」として使って、無効なファイルハンドルにメッセージを送る結果である例外および他のエラーを回避してください。

source: You can use the NSFile Wrapper Reading Immediate and NSFile Wrapper Reading Without Mapping reading options together to take an exact snapshot of a file-system hierarchy that is safe from all errors (including the ones mentioned above) once reading has succeeded.
ja: あなたは、NSFile Wrapper Reading ImmediateおよびNSFile Wrapper Reading Without Mapping読み出しオプションを一緒に使って、ファイルシステム階層の正確なスナップショットを取ることができます、それは一旦読み出しが成功したならば、全くエラーの心配がありません（上で言及するものを含めて）。

source: You can use the URL returned by this method to build paths to files and directories within your app’s ubiquity container.
ja: あなたは、このメソッドによって返されるURLを使って、あなたのアプリの持つ偏在コンテナ内部のファイルやディレクトリに対するパスを組み立てることができます。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, such as the HTTPResponse enumeration in this example.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型、例えばこの例でのHTTPResponse列挙などの要素に対して調べることができます。

source: You can use the predicate to find an element of a type that doesn’t conform to the Equatable protocol or to find an element that matches particular criteria.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型の要素を見つける、または特定の基準に合致する要素を見つけることができます。

source: You can use the token in this property, together with the NSUbiquity Identity Did Change notification, to detect when the user logs in or out of iCloud and to detect changes to the active iCloud account.
ja: あなたは、このプロパティにおけるトークンを、NSUbiquity Identity Did Change通知と一緒に使用して、ユーザがiCloudにログインまたはログアウトする時を検知すること、そしてアクティブなiCloudアカウントに対する変更を検知することができます。

source: You can use the yearForWeekOfYear property with the weekOfYear and weekday properties to get the date corresponding to a particular weekday of a given week of a year.
ja: あなたは、yearForWeekOfYearプロパティをweekOfYearとweekdayプロパティとともにを使って、ある年のある与えられた週の特定の曜日に対応する日付を得ることができます。

source: You can use the zero formatting behaviors (Date Components Formatter .Zero Formatting Behavior) to further modify the formatting of this value.
ja: あなたは、ゼロ書式設定挙動（Date Components Formatter .Zero Formatting Behavior）を使って、この値の書式設定をさらにいっそう修正することができます。

source: You can use these attributes to set the owner and group numbers, file permissions, and modification date.
ja: あなたは、これらの属性を使って、所有者とグループ番号、ファイル権限、そして修正日を設定できます。

source: You can use these interchangeably in code that interacts with Objective-C APIs.
ja: あなたは、Objective-C APIと相互作用するコードにおいて、それらを交換可能に使用できます。

source: You can use this initializer to create a struct Data that wraps a class NSData.
ja: あなたは、このイニシャライザを使ってclass NSDataをラップするstruct Dataを作成できます。

source: You can use this method if you introduce a new class into your application to provide some backwards compatibility in case the archive will be read on a system that does not have that class.
ja: あなたが新しいクラスをあなたのアプリケーションに導入することで、そのクラスを持たないシステム上でアーカイブが読み出される場合に備えていくらかの後方互換性を提供する場合には、あなたはこのメソッドを使うことができます。

source: You can use this method to calculate, for example, the range the day component can take on in the month in which date lies.
ja: あなたはこのメソッドを使って、例えば、day構成要素が、その中にdateが横たわるmonthの中に取ることができる範囲を計算できます。

source: You can use this method to create a new temporary directory.
ja: あなたは、このメソッドを使って新しい一時ディレクトリを作成できます。

source: You can use this method to deliver messages to other threads in your application.
ja: あなたは、このメソッドを使って様々なメッセージをあなたのアプリケーションの別のスレッドに届けることができます。

source: You can use this method to deliver messages to the main thread of your application.
ja: あなたは、このメソッドを使って様々なメッセージをあなたのアプリケーションのメインスレッドに届けることができます。

source: You can use this method to determine whether the file wrapper's contents in memory need to be updated.
ja: あなたは、このメソッドを使ってファイルラッパーの持つインメモリ内容が更新される必要があるかどうかを決定できます。

source: You can use this method to eliminate redundant objects created by the coder.
ja: あなたは、このメソッドを使って、コーダによって作成される冗長なオブジェクトを省くことができます。

source: You can use this method to force iCloud to download a new version of the file or directory from the server.
ja: あなたは、このメソッドを使ってiCloudにサーバからファイルやディレクトリの新版をダウンロードするよう強要できます。

source: You can use this method to get the name of a child that's just been read.
ja: あなたは、このメソッドを使って、たった今読み出された子の名前を得ることができます。

source: You can use this method to load user interfaces and make the objects available to your code.
ja: あなたはこのメソッドを使って、ユーザインターフェイスをロードして、オブジェクトをあなたのコードで利用可能にできます。

source: You can use this method to retrieve the file descriptor while it is open.
ja: あなたはこのメソッドを使ってファイル記述子を、それが開かれている間に、取ってくることができます。

source: You can use this object to execute several blocks at once without having to create separate operation objects for each.
ja: あなたはこのオブジェクトを使って、一度に幾つかのブロックを、それぞれに対して個々のオペレーションオブジェクトを作成する必要なしに実行することができます。

source: You can use this option to ensure that, when overwriting a file package, the overwriting either completely succeeds or completely fails, with no possibility of leaving the file package in an inconsistent state.
ja: あなたはこのオプションを使って、ファイルパッケージを上書きする場合に、上書きが完全に成功するか完全に失敗するかどちらかであることを、ファイルパッケージを矛盾する状態のままにしておく可能性なしに、保証します。

source: You can use this option to keep NSFile Wrapper from memory-mapping files.
ja: あなたはこのオプションを使って、NSFile Wrapperがファイルをメモリマッピングしないようにします。

source: You can use this option to take a snapshot of a file or folder for writing later.
ja: あなたはこのオプションを使って、ファイルまたはフォルダの寸描を取ることができます、もっと後で書き出すために。

source: You can use this type of partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、その部分的な範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、しかしそれを含んでいない範囲を表すことができます。

source: You cannot cancel messages queued using this method.
ja: あなたは、このメソッドを使ってキューされたメッセージをキャンセルできません。

source: You cannot read data from the returned file handle object.
ja: あなたは、返されたファイルハンドルオブジェクトからデータを読み込めません。

source: You cannot use a break or continue statement to exit the current call of the body closure or skip subsequent calls.
ja: あなたは、breakまたはcontinue文を使って、bodyクロージャの現在の呼び出しを抜け出したり、または続いて起こる呼び出しを飛ばしたりできません。

source: You cannot use this method to send an event to other applications.
ja: あなたは、イベントを別のアプリケーションに送信するためにこのメソッドを使うことはできません。

source: You cannot use this method to send Apple events to other applications.
ja: あなたはアップルイベントを他のアプリケーションに送信するためにこのメソッドを使うことはできません。

source: You cannot write data to the returned file handle object.
ja: あなたは、返されるファイルハンドルオブジェクトにデータを書き出しできません。

source: You compose this string with a format string, format, and one or more arguments to be inserted into the string.
ja: あなたは、この文字列をフォーマット文字列、format、そして文字列に挿入される１つ以上の引数から組み立てます。

source: You don't use a bundle object to locate files in a container directory or in other parts of the file system.
ja: あなたは、コンテナディレクトリにおいてまたはファイルシステムの他の部分においてファイルを捜し出すために、バンドルオブジェクトを使いません。

source: You don’t have to use this icon; for example, a file viewer typically looks up icons automatically based on file extensions, and so wouldn’t need this one.
ja: あなたは、このアイコンを使わなくてもかまいません；例えば、ファイルビューアは概してアイコンをファイル拡張子に基づき自動的に調べます、そういうわけでこれは必要ではありません。

source: You don’t typically call this method, as most NSApple Event Descriptor instance methods can’t be safely called on the returned empty descriptor.
ja: あなたは通常このメソッドを呼び出しません、ほとんどのNSApple Event Descriptorインスタンスメソッドが安全に呼び出されることができないので。

source: You implement this protocol when a class’s objects have subcomponents that can be discarded when not being used, thereby giving an application a smaller memory footprint.
ja: あなたはこのプロトコルを、使われていない時に宣言されることができ、それによってアプリケーションがより小さいメモリ占有面積を指定するところの下位構成要素を、あるクラスのオブジェクトが持つ時に実装します。

source: You may also choose to override, partially or fully, any other NSArray method for which you want to provide an alternative implementation.
ja: あなたはまた、それに対してあなたが代替の実装を提供することを望む他のあらゆるNSArrayメソッドを、部分的にまたは完全に、オーバーライドすることを選べます。

source: You may customize the behavior of that function if you wish to return a specialized mutable subclass.
ja: あなたは、その関数の挙動をカスタマイズするかもしれません、あなたが特殊化された可変のサブクラスを返すことを願うならば。

source: You may specify nil for this parameter if you are not interested in the date.
ja: あなたは、nilをこのパラメータに対して指定するかもしれません、もしあなたが日付に興味を持たないならば。

source: You may specify nil for this parameter if you are not interested in the error information.
ja: エラー情報に関心がないならば、あなたはこのパラメータにnilを指定するかもしれません。

source: You may specify nil for this parameter if you do not want the information.
ja: あなたが情報を望まないならば、あなたはこのパラメータにnilを指定するかもしれません。

source: You may specify nil for this parameter.
ja: あなたは、nilをこのパラメータに指定するかもしれません。

source: You may specify a full path or a path that is relative to the current working directory.
ja: あなたは、完全なバスまたは現在の作業ディレクトリに相対的なパスを指定するかもしれません。

source: You may stop the enumeration by setting the stop parameter to true.
ja: あなたは、stopパラメータをtrueに設定することによって、列挙を停止するかもしれません。

source: You may use this method to unload plug-in and framework bundles when you no longer need the code they contain.
ja: あなたは、プラグインやフレームワークバンドルを、それらが含むコードをあなたがもはや必要としない時このメソッドを使ってアンロードするかもしれません。

source: You may want to use it if you write more complicated addition or subtraction routines.
ja: あなたがもっと複雑な加算または減算ルーチンを記述するならば、あなたはそれを使いたいでしょう。

source: You might do this for performance reasons or for better compatibility with legacy code.
ja: あなたはこれを性能上の理由のためにまたはレガシーコードとのより良い互換性のために行います。

source: You might want to implement an initializer for your subclass that is suited to the backing store that the subclass is managing.
ja: あなたは、あなたのサブクラスに対して、そのサブクラスを管理しているバッキングストアに適したイニシャライザを実装したいかもしれません。

source: You must also provide complete implementations of the following methods:
ja: あなたはまた、以下のメソッドの完全な実装を提供しなければなりません：

source: You must call this method from a thread that has an active run loop.
ja: あなたは、このメソッドをアクティブ実行ループを持つスレッドから呼び出さなければなりません。

source: You must not specify NULL for pointer.
ja: あなたは、NULLをpointerに対して指定してはなりません。

source: You must provide the storage for your subclass and implement the primitive methods that directly act on that storage.
ja: あなたは、あなたのサブクラスに対してストレージを提供して、そのストレージ上で直に役割を果たす根本メソッドを実装しなければなりません。

source: You never send a dealloc message directly.
ja: あなたは決してdeallocメッセージを直接に送ってはなりません。

source: You obtain a directory enumerator using NSFile Manager’s enumerator(at Path:) method.
ja: あなたはディレクトリ列挙子を、NSFile Managerの持つenumerator(at Path:)メソッドを使って取得します。

source: You override this method to dispose of resources other than the object’s instance variables, for example:
ja: あなたはこのメソッドをオーバーライドして、オブジェクトのインスタンス変数より他のリソースを片付けるようにします、例えば：

source: You should also implement a class method named for the base unit itself, which may be used interchangeably.
ja: あなたはまた、基本単位それ自身に名前をつけるクラスメソッドを実装すべきです、それは入れ替えて使われるかもしれません。

source: You should associate your delegate with a unique instance of the File Manager class, as opposed to the shared instance.
ja: あなたは、あなたの委任先をFile Managerクラスのある特有のインスタンスと結びつけるべきです、共有インスタンスではなくて。

source: You should call this method only after setting the locale of the receiver.
ja: あなたは、このメソッドをレシーバのlocaleを設定する後にのみ呼び出すべきです。

source: You should define implementations of these methods for any of your scriptable objects that need to perform comparisons for scripting purposes that are different than the comparisons provided by NSComparisonMethods.
ja: あなたはこれらメソッドの実装を、NSComparisonMethodsによって提供される比較とは異なるスクリプティング用途の比較の実行を必要とするあらゆるあなたのスクリプト対応オブジェクトに対して定義すべきです。

source: You should not need to call this function directly.
ja: あなたはこの関数を直接に呼び出す必要があるべきではありません。

source: You should not terminate the list of objects with nil when using this literal syntax, and in fact nil is an invalid value.
ja: あなたは、このリテラル構文を使う時にオブジェクトのリストをnilで終端すべきではありません、そして実際nilは無効な値です。

source: You should not use this property.
ja: あなたは、このプロパティを使うべきではありません。

source: You should obtain this hint when the original array has been sorted, and keep hold of it until you need it, after the array has been modified.
ja: あなたは、元の配列がソートされ終わったときにこのヒントを取得して、配列が修正され終わった後、あなたがそれを必要とするまでそれを保持し続けなければなりません。

source: You should only ever set this Boolean to true within the Block.
ja: あなたは、「ブロック」内でこのブールをtrueに設定できるだけであるべきです。

source: You should only set this property when working with fixed format representations, as discussed in Working With Fixed Format Date Representations.
ja: あなたは、固定された書式設定表現を扱うときにのみこのプロパティを設定するべきです、Working With Fixed Format Date Representationsで議論されるように。

source: You should retain either the returned array or the objects it contains manually to prevent the nib file objects from being released prematurely.
ja: あなたは、返される配列またはそれが手動で含むいくらかのオブジェクトのどちらもリテイン（保持）して、nibファイルオブジェクトが早まってリリースされるのを予防すべきです。

source: You should specify only one domain for your search and you may not specify the all Domains Mask constant for this parameter.
ja: あなたは、ただ１つの領域だけをあなたの検索に対して指定すべきです、そしてあなたはall Domains Mask定数をこのパラメータに対して指定しないでしょう。

source: You should try to avoid managing the lifetime of limited resources such as file descriptors using dealloc.
ja: あなたは、有限リソースの生涯の管理を避けるよう試みるべきです、例えばdeallocを使うファイル記述子など。

source: You should use this method sparingly because it removes the existing transformation matrix, which is an accumulation of transformation matrices for the screen, window, and any superviews.
ja: あなたは、このメソッドを使うのを控えるべきです、なぜならそれは画面、ウインドウ、そしてあらゆるスーパービューに対する変換行列の累算である既存の変換行列を除去するからです。

source: You should use this method to unload bundles that were loaded using the methods of the NSBundle class only.
ja: あなたは、NSBundleクラスのメソッドを使ってロードされたバンドルをアンロードするためにのみ、このメソッドを使うべきです。

source: You shouldn’t need to call this method directly.
ja: あなたは、このメソッドを直接呼び出す必要はないはずです。

source: You typically don't need to use this module directly.
ja: あなたは概してこのモジュールを直接に使う必要はありません。

source: You typically use an NSDimension subclass in conjunction with the NSMeasurement class to represent specific quantities of a particular unit.
ja: あなたは、一般的にNSDimensionサブクラスをNSMeasurementクラスと連携して使って、特定の単位の一定の量を表します。

source: You typically use this method to locate one of the standard system directories, such as the Documents, Application Support or Caches directories.
ja: あなたは、概してこのメソッドを使って標準システムディレクトリの１つの位置を突き止めます、例えばDocuments、Application SupportまたはCachesディレクトリなど。

source: You typically use this method to match on a particular string within a larger pattern.
ja: あなたは概してこのメソッドを使って、より大きなパターン内部の特定の文字列に関してマッチを行います。

source: You use Bundle objects to obtain the location of specific resources inside the bundle.
ja: あなたは、Bundleオブジェクトを使ってバンドル内部の特定のリソースの位置を取得します。

source: You use NSComparator blocks in comparison operations such as NSArray’s sorted Array(comparator:), for example:
ja: あなたは、NSComparatorブロックを比較演算、例えばNSArrayの持つsorted Array(comparator:)などにおいて使います、例えば：

source: You use file handle objects to access data associated with files, sockets, pipes, and devices.
ja: あなたは、ファイルハンドルオブジェクトを使って、ファイル、ソケット、パイプ、そしてデバイスと結びつけられたデータにアクセスします。

source: You use it to locate, create, copy, and move files and directories.
ja: あなたはそれを使って、ファイルとディレクトリの位置を突き止める、作成する、コピーする、そして移動をします。

source: You use one of these group identifier strings to locate the corresponding group's shared directory.
ja: あなたは、それらグループ識別子文字列の１つを使って、対応するグループの持つ共有ディレクトリの位置を突き止めます。

source: You use this function to cast an Objective-C object as Core Foundation-style object and take ownership of the object so that you can manage its lifetime.
ja: あなたは、この関数を使ってObjective-CオブジェクトをCore Foundation形式のオブジェクトとしてキャストして、そしてオブジェクトの所有権を取ります、それであなたはそれのライフタイムを管理できます。

source: You use this method to determine the location of your app’s ubiquity container directories and to configure your app’s initial iCloud access.
ja: あなたはこのメソッドを使ってあなたのアプリの偏在コンテナディレクトリの位置を決定して、あなたのアプリの最初のiCloudアクセスを構成設定します。

source: You use this method to get an appropriate format string for a given set of components for a specified locale (typically you use the current locale—see current).
ja: あなたはこのメソッドを使って、指定されたロケールに対して、与えられたひとそろいの構成要素のために、適切に書式設定された文字列を取得します（大抵はあなたは現在のロケールを使います — currentを見てください）。

source: Your app must have access to the network for this call to succeed.
ja: あなたのアプリは、この呼び出しを成功させるためにネットワークにアクセスする必要があります。

source: Your application can use this notification to avoid registering any Apple event handlers until the first time at which they may be needed.
ja: あなたのアプリケーションは、この通知をそれが必要とされるかもしれない最初の時まで何らかのアップルイベントハンドラを登録することを避けるために使用できます。

source: Your block is submitted to the file handle’s dispatch queue when there is data to read.
ja: あなたのブロックは、読み込むデータがある場合は、ファイルハンドルの持つディスパッチキューに提出されます。

source: Your block is submitted to the file handle’s dispatch queue when there is room available to write more data.
ja: あなたのブロックは、もっとデータを書き込むのに利用可能なあき場所がある場合、ファイルハンドルの持つディスパッチキューに提出されます。

source: Your override of this method doesn't need to also invoke any of the NSScript Command error signaling methods, though it can, to record very specific information.
ja: あなたのこのメソッドのオーバーライドは、大変に具体的な情報を記録するためにいかなるNSScript Commandエラー合図メソッドもまた、それが出来るにもかかわらず、発動する必要はありません。

source: Your overriding method must provide an appropriate method signature for the given selector, either by pre formulating one or by asking another object for one.
ja: あなたのオーバーライドメソッドは、指定されたセレクタに対して適切なメソッドシグネチャを提供しなければなりません、あらかじめ考案するものによって、または別のオブジェクトにそれを要求することによってのどちらかで。

source: You’ll also find information on the four-character codes used to identify information within a descriptor.
ja: あなたはまた、ある記述子内部で情報を識別するのに使われる４文字コードに関する情報も見つけるでしょう。

source: You’ll find terms such as descriptor, descriptor list, Apple event record, and Apple event defined in Building an Apple Event in Apple Events Programming Guide.
ja: あなたは、記述子、記述子リスト、アップルイベントレコード、そしてアップルイベントなどの用語を「Building an Apple Event」の中の「Building an Apple Event」で定義されるのを見るでしょう。

source: ZB and YB cannot be covered by the range of possible values, but you can still choose to use these units to get fractional display (0 .0035 ZB for instance).
ja: ZB と YB は、可能な値の範囲を越えています、しかしあなたは依然としてこれらの単位を使うことを選択して少数表示を得ることができます（例えば0 .0035 ZB）。

source: Zero is neither a normal nor a subnormal number.
ja: ゼロは、ノーマルでもサブノーマル数でもありません。

source: \b, outside of a [Set]
ja: \b、[集合]外で

source: \b, within a [Set]
ja: \b、[集合]内で

source: amperes (A)
ja: アンペア（A）

source: compile or execute a script or an individual Apple event
ja: スクリプトまたは単一のアップルイベントをコンパイルまたは実行する

source: coulombs (C)
ja: クーロン (C)

source: degrees (°)
ja: 度（°）

source: e.g. Given intervals a and b
ja: 例えば、間隔 a と b を与えられて

source: e.g. Given intervals c and d
ja: 例えば、間隔 c と d を与えられて

source: file-system node from which to create the file wrapper to add to the directory.
ja: ファイルシステムノード、それからファイルラッパーが作成されてディレクトリに加えられることになります。

source: file-system node with which to compare the file wrapper.
ja: それとファイルラッパーを比較するファイルシステムノード。

source: flags
ja: フラグ

source: hertz (Hz)
ja: ヘルツ（Hz）

source: iCloud Sharing Errors
ja: iCloud共有エラー

source: iCloud Storage
ja: iCloudストレージ

source: iOS Note
ja: iOS 注意

source: is equivalent to:
ja: これは次と同等です：

source: joules (J)
ja: ジュール（J）

source: kelvin (K)
ja: ケルビン（K）

source: kilograms (kg)
ja: キログラム（kg）

source: liters (L)
ja: リットル（L）

source: liters per 100 kilometers (L/100km)
ja: リットル毎100キロメートル（L/100km）

source: load a script from a URL or from a text string
ja: スクリプトをURLからまたはテキスト文字列からロードする

source: lux (lx)
ja: ルクス（lx）

source: meters (m)
ja: メートル（m）

source: meters per second (m/s)
ja: メートル毎秒（m/s）

source: meters per second squared (m/s²)
ja: メートル毎秒毎秒（m/s²）

source: milligrams per deciliter (mg/dL)
ja: ミリグラム毎デシリットル（mg/dL）

source: newtons per square meter (N/m²)
ja: ニュートン毎平方メートル（N/m²）

source: numberOfCaptureGroups
ja: 捕えたグループの数

source: obtain an NSApple Event Descriptor containing the reply from an executed script or event
ja: 実行されたスクリプトまたはイベントからの返答を含んでいるNSApple Event Descriptorを入手する

source: obtain an attributed string for a compiled script, suitable for display in a script editor
ja: コンパイルされたスクリプトに対する属性付き文字列を、スクリプトエディタで表示するのにふさわしく入手する

source: obtain various kinds of information about any errors that may occur
ja: 起こるかもしれない何らかのエラーについて様々な種類の情報を入手する

source: ohms (Ω)
ja: オーム（Ω）

source: options
ja: オプション

source: parts per million (ppm)
ja: 100万分の１（ppm）

source: pattern
ja: パターン

source: regularExpressionWithPattern:options:error:
ja: パターンで正規表現をつくる

source: result
ja: 結果

source: returns the string employees.
ja: 上記は文字列employeesを返します。

source: seconds (sec)
ja: 秒数（sec）

source: square meters (m²)
ja: 平方メートル（m²）

source: stop
ja: 中止

source: volts (V)
ja: ボルト（V）

source: watts (W)
ja: ワット（W）

source: you can use resolve Instance Method: to dynamically add it to a class as a method (called resolve This Method Dynamically) like this:
ja: あなたはresolve Instance Method:を使うことで、このように、それをあるクラスへ（resolve This Method Dynamicallyと呼ばれる）メソッドとして動的に加えることができます：
